; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v7 ?v1)
             (pred_11 ?v6 ?v4)
             (pred_4 ?v7 ?v4)
             (pred_7 ?v3 ?v7 )
	     (pred_9 ?v7)
             (pred_2 ?v2)
             (pred_5 ?v6)
             (pred_6 ?v4)
             (pred_3 ?v7)
             (pred_8 ?v6)
             (pred_10 ?v7)
             (pred_12 ))



(:action op_1
:parameters (?v5 ?v9 ?v10 ?v8)
:precondition (and (pred_2 ?v5) (pred_2 ?v9) (pred_5 ?v10) (pred_6 ?v8)
          (pred_1 ?v5 ?v9) (pred_11 ?v10 ?v8)
                   (pred_4 ?v9 ?v8) (pred_9 ?v5) 
                   (pred_3 ?v9) (pred_8 ?v10))
:effect (and  (pred_10 ?v9) (not (pred_3 ?v9))))


(:action op_3
:parameters (?v5 ?v11)
:precondition (and (pred_2 ?v5) (pred_2 ?v11)
               (pred_9 ?v5) (pred_1 ?v5 ?v11) (pred_10 ?v11))
:effect (and (pred_9 ?v11) (not (pred_9 ?v5))))

(:action op_4
:parameters (?v5 ?v10)
:precondition (and (pred_2 ?v5) (pred_5 ?v10) 
                  (pred_9 ?v5) (pred_7 ?v10 ?v5) (pred_12 ))
:effect (and (pred_8 ?v10)
   (not (pred_7 ?v10 ?v5)) (not (pred_12 ))))


(:action op_2
:parameters (?v5 ?v12 ?v13)
:precondition (and (pred_2 ?v5) (pred_5 ?v12) (pred_5 ?v13)
                  (pred_9 ?v5) (pred_8 ?v13) (pred_7 ?v12 ?v5))
:effect (and (pred_8 ?v12) (pred_7 ?v13 ?v5)
        (not (pred_8 ?v13)) (not (pred_7 ?v12 ?v5))))

(:action op_5
:parameters (?v5 ?v10)
:precondition (and (pred_2 ?v5) (pred_5 ?v10) 
                  (pred_9 ?v5) (pred_8 ?v10))
:effect (and (pred_12 ) (pred_7 ?v10 ?v5) (not (pred_8 ?v10)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_12 obj_04 obj_02 obj_01 obj_11 obj_16 obj_18 obj_05 obj_14 obj_06 obj_20 obj_07 obj_15 obj_17 obj_08
    obj_10 obj_03
    obj_09 obj_13 obj_19
    )

    (:init
       (pred_12)

       (pred_2 obj_21)
       (pred_2 obj_12)
       (pred_2 obj_04)
       (pred_2 obj_02)
       (pred_2 obj_01)
       (pred_2 obj_11)
       (pred_2 obj_16)
       (pred_2 obj_18)
       (pred_2 obj_05)
       (pred_2 obj_14)
       (pred_2 obj_06)
       (pred_2 obj_20)
       (pred_2 obj_07)
       (pred_2 obj_15)
       (pred_2 obj_17)
       (pred_2 obj_08)
       (pred_6 obj_10)
       (pred_6 obj_03)
       (pred_5 obj_09)
       (pred_5 obj_13)
       (pred_5 obj_19)

       (pred_1 obj_21 obj_01)
       (pred_1 obj_21 obj_12)
       (pred_1 obj_12 obj_11)
       (pred_1 obj_12 obj_04)
       (pred_1 obj_12 obj_21)
       (pred_1 obj_04 obj_16)
       (pred_1 obj_04 obj_02)
       (pred_1 obj_04 obj_12)
       (pred_1 obj_02 obj_18)
       (pred_1 obj_02 obj_04)
       (pred_1 obj_01 obj_05)
       (pred_1 obj_01 obj_11)
       (pred_1 obj_01 obj_21)
       (pred_1 obj_11 obj_14)
       (pred_1 obj_11 obj_16)
       (pred_1 obj_11 obj_12)
       (pred_1 obj_11 obj_01)
       (pred_1 obj_16 obj_06)
       (pred_1 obj_16 obj_18)
       (pred_1 obj_16 obj_04)
       (pred_1 obj_16 obj_11)
       (pred_1 obj_18 obj_20)
       (pred_1 obj_18 obj_02)
       (pred_1 obj_18 obj_16)
       (pred_1 obj_05 obj_07)
       (pred_1 obj_05 obj_14)
       (pred_1 obj_05 obj_01)
       (pred_1 obj_14 obj_15)
       (pred_1 obj_14 obj_06)
       (pred_1 obj_14 obj_11)
       (pred_1 obj_14 obj_05)
       (pred_1 obj_06 obj_17)
       (pred_1 obj_06 obj_20)
       (pred_1 obj_06 obj_16)
       (pred_1 obj_06 obj_14)
       (pred_1 obj_20 obj_08)
       (pred_1 obj_20 obj_18)
       (pred_1 obj_20 obj_06)
       (pred_1 obj_07 obj_15)
       (pred_1 obj_07 obj_05)
       (pred_1 obj_15 obj_17)
       (pred_1 obj_15 obj_14)
       (pred_1 obj_15 obj_07)
       (pred_1 obj_17 obj_08)
       (pred_1 obj_17 obj_06)
       (pred_1 obj_17 obj_15)
       (pred_1 obj_08 obj_20)
       (pred_1 obj_08 obj_17)
       (pred_3 obj_20)
       (pred_3 obj_11)
       (pred_3 obj_14)
       (pred_4  obj_20 obj_10)
       (pred_4  obj_11 obj_03)
       (pred_4  obj_14 obj_03)
       (pred_10 obj_21)
       (pred_10 obj_12)
       (pred_10 obj_04)
       (pred_10 obj_02)
       (pred_10 obj_01)
       (pred_10 obj_16)
       (pred_10 obj_18)
       (pred_10 obj_05)
       (pred_10 obj_06)
       (pred_10 obj_07)
       (pred_10 obj_15)
       (pred_10 obj_17)
       (pred_10 obj_08)

       (pred_11  obj_09 obj_10)
       (pred_11  obj_13 obj_03)
       (pred_11  obj_19 obj_10)
       (pred_7 obj_09 obj_15)
       (pred_7 obj_13 obj_17)
       (pred_7 obj_19 obj_06)
       (pred_9 obj_18)
    )

    (:goal (and
       (pred_7 obj_09 obj_17)
       (pred_7 obj_19 obj_18)
    ))
(:constraints
  (always (not (pred_9 obj_16)))
)
)

; plan
1. (op_3 obj_18 obj_02)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_02)
   goals met: 0 of 2
2. (op_3 obj_02 obj_04)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_04)
   goals met: 0 of 2
3. (op_3 obj_04 obj_12)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_12)
   goals met: 0 of 2
4. (op_3 obj_12 obj_21)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_21)
   goals met: 0 of 2
5. (op_3 obj_21 obj_01)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_01)
   goals met: 0 of 2
6. (op_3 obj_01 obj_05)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_05)
   goals met: 0 of 2
7. (op_3 obj_05 obj_07)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_07)
   goals met: 0 of 2
8. (op_3 obj_07 obj_15)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_15)
   goals met: 0 of 2
9. (op_4 obj_15 obj_09)
   deleted: (pred_7 obj_09 obj_15) (pred_12)
   added: (pred_8 obj_09)
   goals met: 0 of 2
10. (op_3 obj_15 obj_17)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_17)
   goals met: 0 of 2
11. (op_2 obj_17 obj_13 obj_09)
   deleted: (pred_8 obj_09) (pred_7 obj_13 obj_17)
   added: (pred_8 obj_13) (pred_7 obj_09 obj_17)
   goals met: 1 of 2
12. (op_3 obj_17 obj_06)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_06)
   goals met: 1 of 2
13. (op_2 obj_06 obj_19 obj_13)
   deleted: (pred_8 obj_13) (pred_7 obj_19 obj_06)
   added: (pred_8 obj_19) (pred_7 obj_13 obj_06)
   goals met: 1 of 2
14. (op_1 obj_06 obj_20 obj_19 obj_10)
   deleted: (pred_3 obj_20)
   added: (pred_10 obj_20)
   goals met: 1 of 2
15. (op_3 obj_06 obj_20)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_20)
   goals met: 1 of 2
16. (op_3 obj_20 obj_18)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_18)
   goals met: 1 of 2
17. (op_5 obj_18 obj_19)
   deleted: (pred_8 obj_19)
   added: (pred_12) (pred_7 obj_19 obj_18)
   goals met: 2 of 2
